app/controllers/coaches_controller.rb

  def index
    @coaches = Coach.all
---
SELECT "coaches".* FROM "coaches"

  def show
    @coach = Coach.find(params[:id])
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @coach = Coach.find(params[:id])
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT 1  [["id", 1]]

  def create
    # render plain: params [:coach].inspect
    # @coach = Coach.new(params.require(:coach).permit(:name, :tidbit))
    @coach = Coach.new(coach_params)

    if @coach.save
---
INSERT INTO "coaches" ("name", "tidbit", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ghjgjhj"], ["tidbit", "gghhh"], ["created_at", "2016-04-27 19:51:01.744879"], ["updated_at", "2016-04-27 19:51:01.744879"]]

  def update
    @coach = Coach.find(params[:id])
    if @coach.update(article_params)
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "coaches" SET "name" = ?, "tidbit" = ?, "updated_at" = ? WHERE "coaches"."id" = ?  [["name", "Bill Walsh"], ["tidbit", "Won 3 Super Bowls as the San frANCISCO 49ERS HEAD COACH."], ["updated_at", "2016-04-27 21:05:52.437599"], ["id", 1]]

  def destroy
    @coach = Coach.find(params[:id])
    @coach.destroy
---
SELECT  "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "coaches" WHERE "coaches"."id" = ?  [["id", 2]]